## 1 - SetUp Environment

In [1]:
import numpy as np
import pandas as pd
import pickle

<hr>

## 2 - Load Features

In [2]:
with open('../Assets/Version 4-1.pickle', 'rb') as file:
    df = pickle.load(file)

<hr>

## 3 - Map Categories to number

since machine learning models need number instead of string, we have to convert categories (that are not number) to number. Of all categorical variable, we just map <b>"Sex", "Cabin", "Embarked"</b> to number.

> ### 3.1 - Sex

In [3]:
df['Sex'].value_counts()

male      842
female    464
Name: Sex, dtype: int64

In [4]:
map_sex = {'male': 0, 'female': 1}

df['Sex'] = df['Sex'].map(map_sex)

df.head(3)

    Age  Parch     Fare  Pclass  Sex    Cabin Embarked  Survived
0  22.0      0   7.2500       3    0  Unknown        S         0
1  38.0      0  71.2833       1    1        C        C         1
2  26.0      0   7.9250       3    1  Unknown        S         1

> ### 3.2 - Cabin

In [5]:
df['Cabin'].value_counts()

Unknown    1013
C            94
B            63
D            46
E            41
A            22
F            21
G             5
T             1
Name: Cabin, dtype: int64

In [6]:
map_cabin = {'Unknown': 0, 'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 5, 'F': 6, 'G': 7, 'T': 7}

df['Cabin'] = df['Cabin'].map(map_cabin)

df.head(3)

    Age  Parch     Fare  Pclass  Sex  Cabin Embarked  Survived
0  22.0      0   7.2500       3    0      0        S         0
1  38.0      0  71.2833       1    1      3        C         1
2  26.0      0   7.9250       3    1      0        S         1

> ### 3.3 - Embarked

In [7]:
df['Embarked'].value_counts()

S    913
C    270
Q    123
Name: Embarked, dtype: int64

In [8]:
map_embarked = {'S': 0, 'C': 1, 'Q': 2}

df['Embarked'] = df['Embarked'].map(map_embarked)

df.head(3)

    Age  Parch     Fare  Pclass  Sex  Cabin  Embarked  Survived
0  22.0      0   7.2500       3    0      0         0         0
1  38.0      0  71.2833       1    1      3         1         1
2  26.0      0   7.9250       3    1      0         0         1

<hr>

## Check Point

In [9]:
with open('../Assets/Version 4-2-mapped.pickle', 'wb') as file:
    pickle.dump(df, file)